#include <string.h>

static const char *eisu[] = {
	"#", "E", "$", "%", "&", "\x27", "(", ")", "|", "Z", "y", "3", "e", "4", "5", "6", "t", "g", "h", ":", "b", "x", "d", "r", "p", "c", "q", "a", "z", "w", "s", "u", "i", "1", ",", "k", "f", "v", "2", "^", "-", "j", "n", "]", "/", "m", "7", "8", "9", "o", "l", ".", ";", "`", "0", ">", "<", "?", "{", "}", "\\", "[", "@"
	""
};

static const char *kana[] = {
	"ぁ", "ぃ", "ぅ", "ぇ", "ぉ", "ゃ", "ゅ", "ょ", "を", "っ", "ん", "あ", "い", "う", "え", "お", "か", "き", "く", "け", "こ", "さ", "し", "す", "せ", "そ", "た", "ち", "つ", "て", "と", "な", "に", "ぬ", "ね", "の", "は", "ひ", "ふ", "へ", "ほ", "ま", "み", "む", "め", "も", "や", "ゆ", "よ", "ら", "り", "る", "れ", "ろ", "わ", "。", "、", "・", "「", "」", "ー", "゜", "゛",
	""
};

const char *Translate(const char *ch)
{
	unsigned i = 0;
	while (kana[i][0] != '\0' && strcmp(ch, kana[i]) != 0) ++i;
	if (kana[i][0] == '\0') return ch;
	else                    return eisu[i];
}
